%:1504080069陈雅玲
clc
clear all
title=figure('name','2018年春节联欢晚会');
axis([0,10,0,10]); %画坐标
set(title,'color',[1 0 0] ); %底色设为红色
hold on;
grid on; %画出坐标网格
axis off;%关闭坐标
hold on;
grid on; %画出坐标网格
%下面为依次写出2018春节联欢晚会现在开始
text(1,5,'2 ','fontsize',18,'color','w');
pause(0.2);
text(1.5,5,'0 ','fontsize',18,'color','w');
pause(0.2);
text(2,5,'1 ','fontsize',18,'color','w');
pause(0.2);
text(2.5,5,'8 ','fontsize',18,'color','w');
pause(0.2);
text(3,5,'春 ','fontsize',17,'color','w');
pause(0.2);
text(3.5,5,'节 ','fontsize',17,'color','w');
pause(0.2);
text(4,5,'联 ','fontsize',17,'color','w');
pause(0.2);
text(4.5,5,'欢 ','fontsize',17,'color','w');
pause(0.2);
text(5,5,'晚 ','fontsize',17,'color','w');
pause(0.2);
text(5.5,5,'会 ','fontsize',17,'color','w');
pause(0.2);
text(6,5,'现 ','fontsize',17,'color','w');
pause(0.2);
text(6.5,5,'在 ','fontsize',17,'color','w');
pause(0.2);
text(7,5,'开 ','fontsize',17,'color','w');
pause(0.2);
text(7.5,5,'始 ','fontsize',17,'color','w');
pause(1);
text(3,3,'有请主持人董卿', 'fontsize' ,17,'color','w')%请出主持人
pause(2); %显示完毕
clf;   %清屏幕，载入新的页
axis([-35,30,-5,50]); %定义坐标系
hold on; %保持图形
axis off; %关闭坐标
%接下来画主持人
a1=line(-30,12,'color','y','linestyle','-','markersize',70);%画头部，设定位置，大小，填充颜色
a2=line(-29.1,12.5,'color','black','linestyle','-','markersize',8);%画左眼，设定位置，大小，填充颜色
a3=line(-30.9,12.5,'color','black','linestyle','-','markersize',8);%画右眼，设定位置，大小，填充颜色
a4=line([-30.5,-29.5],[11,11],'color','k','linewidth',0.5);%画嘴巴，设定嘴巴的位置，大小
a5=fill([-28,-28.8,-31.2,-32],[4.5,9.8,9.8,4.5],[1,0.8,0.8]);%画人的身体，设定位置，大小，填充颜色
a6=fill([-27,-27,-28.8,-28.8],[4.5,5.5,9.5,8.5], 'y');%画人的左手，设定位置，大小，填充颜色
a7=fill([-33,-33,-31.2,-31.2],[4.5,5.5,9.5,8.5], 'y');%画人的右手，设定位置，大小，填充颜色
a8=fill([-28.8,-29.3,-29.3,-28.8],[4.5,4.5,-3,-3],'k');%画人的左脚，设定位置，大小，填充颜色
a9=fill([-30.7,-31.2,-31.2,-30.7],[4.5,4.5,-3,-3],'k');%画人的右脚，设定位置，大小，填充颜色
%以下主持人走上舞台
dt=2;
t=-30;
x1=-30;
x2=-29.1;
x3=-30.9;
x4=-30.5;
x5=-29.5;
x6=-28;
x7=-28.8;
x8=-31.2;
x9=-32;
x10=-27;
x11=-28.8;
x12=-33;
x13=-31.2;
x14=-28.8;
x15=-29.3;
x16=-30.7;
x17=-31.2;
x18=-38;
x19=-22;
while t<=-10;
    t=t+dt;
    x1=x1+dt;
    x2=x2+dt;
    x3=x3+dt;
    x4=x4+dt;
    x5=x5+dt;
    x6=x6+dt;
    x7=x7+dt;
    x8=x8+dt;
    x9=x9+dt;
    x10=x10+dt;
    x11=x11+dt;
    x12=x12+dt;
    x13=x13+dt;
    x14=x14+dt;
    x15=x15+dt;
    x16=x16+dt;
    x17=x17+dt;
    x18=x18+dt;
    x19=x19+dt;
    set(a1,'xdata',x1 ,'ydata',12);%头的运动路线                  
  set(a2,'xdata',x2,'ydata',12.5);%左眼的运动路线
  set(a3,'xdata',x3,'ydata',12.5); %右眼的运动路线
  set(a4,'xdata',[x4,x5],'ydata',[11,11]);%嘴巴的运动轨迹
    set(a5,'xdata',[x6,x7,x8,x9],'ydata',[4.5,9.8,9.8,4.5]);%身体的运动路线
    set(a6,'xdata',[x10,x10,x11,x11],'ydata',[4.5,5.5,9.5,8.5]);%左手的运动路线
    set(a7,'xdata',[x12,x12,x13,x13],'ydata',[4.5,5.5,9.5,8.5]);%右手的运动路线
    set(a8,'xdata',[x14,x15,x15,x14],'ydata',[4.5,4.5,-3,-3]);%左脚的运动路线
    set(a9,'xdata',[x16,x17,x17,x16],'ydata',[4.5,4.5,-3,-3]);%右脚的运动路线
    pause(0.1);%停顿零点一秒
end;
pause(1.5);%停顿1.5秒
t1=text(-18,50,'春到福来，春上春伦云天外', 'fontsize' ,15,'color','b');
pause(2);%停顿两秒
t2=text(-18,45,'春到福来，春向黄河冰雪开', 'fontsize' ,15,'color','b');
pause(2);%停顿两秒
t3=text(-16,40,'各位亲爱的朋友们', 'fontsize' ,15,'color','b');
pause(1);%停顿一秒
t4=text(-14,35,'过年好！', 'fontsize' ,18,'color','b');
pause(2);%停顿两秒
% delete(t1,t2,t3,t4);
pause(1);%停顿一秒
text(-35,40,'接下来让我们有请第一位表演嘉宾为我们带来杂技', 'fontsize' ,15,'color','b');
pause(2); %显示完毕
clf;   %清屏幕，载入新的页
axis([-35,30,-5,50]); %定义坐标系
hold on; %保持图形
axis off; %关闭坐标
%接下来画第一个杂技演员
a1=line(-30,12,'color','y','linestyle','-','markersize',70);%画头部，设定位置，大小，填充颜色
a2=line(-29.1,12.5,'color','black','linestyle','-','markersize',8);%画左眼，设定位置，大小，填充颜色
a3=line(-30.9,12.5,'color','black','linestyle','-','markersize',8);%画右眼，设定位置，大小，填充颜色
a4=line([-30.5,-29.5],[11,11],'color','k','linewidth',0.5);%画嘴巴，设定嘴巴的位置，大小
a5=fill([-28,-28.8,-31.2,-32],[4.5,9.8,9.8,4.5],[0.7,0.9,0.8]);%画人的身体，设定位置，大小，填充颜色
a6=fill([-27,-27,-28.8,-28.8],[4.5,5.5,9.5,8.5], 'y');%画人的左手，设定位置，大小，填充颜色
a7=fill([-33,-33,-31.2,-31.2],[4.5,5.5,9.5,8.5], 'y');%画人的右手，设定位置，大小，填充颜色
a8=fill([-28.8,-29.3,-29.3,-28.8],[4.5,4.5,-3,-3],'k');%画人的左脚，设定位置，大小，填充颜色
a9=fill([-30.7,-31.2,-31.2,-30.7],[4.5,4.5,-3,-3],'k');%画人的右脚，设定位置，大小，填充颜色
%画第二个杂技演员
b1=line(-30,30,'color','y','linestyle','-','markersize',70);%画头部，设定位置，大小，填充颜色
b2=line(-29.1,30.5,'color','black','linestyle','-','markersize',8);%画左眼，设定位置，大小，填充颜色
b3=line(-30.9,30.5,'color','black','linestyle','-','markersize',8);%画右眼，设定位置，大小，填充颜色
b4=line([-30.5,-29.5],[29,29],'color','k','linewidth',0.5);%画嘴巴，设定嘴巴的位置，大小
b5=fill([-28,-28.8,-31.2,-32],[22.5,27.8,27.8,22.5],[0.7,0.9,0.8]);%画人的身体，设定位置，大小，填充颜色
b6=fill([-27,-27,-28.8,-28.8],[22.5,23.5,27.5,26.5], 'y');%画人的左手，设定位置，大小，填充颜色
b7=fill([-33,-33,-31.2,-31.2],[22.5,23.5,27.5,26.5], 'y');%画人的右手，设定位置，大小，填充颜色
b8=fill([-28.8,-29.3,-29.3,-28.8],[22.5,22.5,14,14],'k');%画人的左脚，设定位置，大小，填充颜色
b9=fill([-30.7,-31.2,-31.2,-30.7],[22.5,22.5,14,14],'k');%画人的右脚，设定位置，大小，填充颜色
%画第三个杂技演员
c1=line(-30,48,'color','y','linestyle','-','markersize',70);%画头部，设定位置，大小，填充颜色
c2=line(-29.1,48.5,'color','black','linestyle','-','markersize',8);%画左眼，设定位置，大小，填充颜色
c3=line(-30.9,48.5,'color','black','linestyle','-','markersize',8);%画右眼，设定位置，大小，填充颜色
c4=line([-30.5,-29.5],[47,47],'color','k','linewidth',0.5);%画嘴巴，设定嘴巴的位置，大小
c5=fill([-28,-28.8,-31.2,-32],[40.5,45.8,45.8,40.5],[0.7,0.9,0.8]);%画人的身体，设定位置，大小，填充颜色
c6=fill([-27,-27,-28.8,-28.8],[40.5,41.5,45.5,44.5], 'y');%画人的左手，设定位置，大小，填充颜色
c7=fill([-33,-33,-31.2,-31.2],[40.5,41.5,45.5,44.5], 'y');%画人的右手，设定位置，大小，填充颜色
c8=fill([-28.8,-29.3,-29.3,-28.8],[40.5,40.5,32,32],'k');%画人的左脚，设定位置，大小，填充颜色
c9=fill([-30.7,-31.2,-31.2,-30.7],[40.5,40.5,32,32],'k');%画人的右脚，设定位置，大小，填充颜色
pause(1);
%接下来三个杂技演员叠加表演
dt=2;
t=-30;
x1=-30;
x2=-29.1;
x3=-30.9;
x4=-30.5;
x5=-29.5;
x6=-28;
x7=-28.8;
x8=-31.2;
x9=-32;
x10=-27;
x11=-28.8;
x12=-33;
x13=-31.2;
x14=-28.8;
x15=-29.3;
x16=-30.7;
x17=-31.2;
x18=-38;
x19=-22;
while t<=15;
    t=t+dt;
    x1=x1+dt;
    x2=x2+dt;
    x3=x3+dt;
    x4=x4+dt;
    x5=x5+dt;
    x6=x6+dt;
    x7=x7+dt;
    x8=x8+dt;
    x9=x9+dt;
    x10=x10+dt;
    x11=x11+dt;
    x12=x12+dt;
    x13=x13+dt;
    x14=x14+dt;
    x15=x15+dt;
    x16=x16+dt;
    x17=x17+dt;
    x18=x18+dt;
    x19=x19+dt;
    set(a1,'xdata',x1 ,'ydata',12);%第一个演员头的运动路线                  
    set(a2,'xdata',x2,'ydata',12.5);%左眼的运动路线
    set(a3,'xdata',x3,'ydata',12.5); %右眼的运动路线
    set(a4,'xdata',[x4,x5],'ydata',[11,11]);%嘴巴的运动轨迹
    set(a5,'xdata',[x6,x7,x8,x9],'ydata',[4.5,9.8,9.8,4.5]);%身体的运动路线
    set(a6,'xdata',[x10,x10,x11,x11],'ydata',[4.5,5.5,9.5,8.5]);%左手的运动路线
    set(a7,'xdata',[x12,x12,x13,x13],'ydata',[4.5,5.5,9.5,8.5]);%右手的运动路线
    set(a8,'xdata',[x14,x15,x15,x14],'ydata',[4.5,4.5,-3,-3]);%左脚的运动路线
    set(a9,'xdata',[x16,x17,x17,x16],'ydata',[4.5,4.5,-3,-3]);%右脚的运动路线
    set(b1,'xdata',x1 ,'ydata',30);%第二个头的运动路线                  
    set(b2,'xdata',x2,'ydata',30.5);%左眼的运动路线
    set(b3,'xdata',x3,'ydata',30.5); %右眼的运动路线
    set(b4,'xdata',[x4,x5],'ydata',[29,29]);%嘴巴的运动轨迹
    set(b5,'xdata',[x6,x7,x8,x9],'ydata',[22.5,27.8,27.8,22.5]);%身体的运动路线
    set(b6,'xdata',[x10,x10,x11,x11],'ydata',[22.5,23.5,27.5,26.5]);%左手的运动路线
    set(b7,'xdata',[x12,x12,x13,x13],'ydata',[22.5,23.5,27.5,26.5]);%右手的运动路线
    set(b8,'xdata',[x14,x15,x15,x14],'ydata',[22.5,22.5,14,14]);%左脚的运动路线
    set(b9,'xdata',[x16,x17,x17,x16],'ydata',[22.5,22.5,14,14]);%右脚的运动路线
    set(c1,'xdata',x1 ,'ydata',48);%第三个演员头的运动路线                 
    set(c2,'xdata',x2,'ydata',48.5);%左眼的运动路线
    set(c3,'xdata',x3,'ydata',48.5); %右眼的运动路线
    set(c4,'xdata',[x4,x5],'ydata',[47,47]);%嘴巴的运动轨迹
    set(c5,'xdata',[x6,x7,x8,x9],'ydata',[40.5,45.8,45.8,40.5]);%身体的运动路线
    set(c6,'xdata',[x10,x10,x11,x11],'ydata',[40.5,41.5,45.5,44.5]);%左手的运动路线
    set(c7,'xdata',[x12,x12,x13,x13],'ydata',[40.5,41.5,45.5,44.5]);%右手的运动路线
    set(c8,'xdata',[x14,x15,x15,x14],'ydata',[40.5,40.5,32,32]);%左脚的运动路线
    set(c9,'xdata',[x16,x17,x17,x16],'ydata',[40.5,40.5,32,32]);%右脚的运动路线
    pause(0.5);%停顿一秒
end
pause(2); %显示完毕
clf;   %清屏幕，载入新的页
%接下来画主持人
axis([-35,30,-5,50]); %定义坐标系
hold on; %保持图形
axis off; %关闭坐标
%再次请出董卿
a1=line(-30,12,'color','y','linestyle','-','markersize',70);%画头部，设定位置，大小，填充颜色
a2=line(-29.1,12.5,'color','black','linestyle','-','markersize',8);%画左眼，设定位置，大小，填充颜色
a3=line(-30.9,12.5,'color','black','linestyle','-','markersize',8);%画右眼，设定位置，大小，填充颜色
a4=line([-30.5,-29.5],[11,11],'color','k','linewidth',0.5);%画嘴巴，设定嘴巴的位置，大小
a5=fill([-28,-28.8,-31.2,-32],[4.5,9.8,9.8,4.5],[1,0.8,0.8]);%画人的身体，设定位置，大小，填充颜色
a6=fill([-27,-27,-28.8,-28.8],[4.5,5.5,9.5,8.5], 'y');%画人的左手，设定位置，大小，填充颜色
a7=fill([-33,-33,-31.2,-31.2],[4.5,5.5,9.5,8.5], 'y');%画人的右手，设定位置，大小，填充颜色
a8=fill([-28.8,-29.3,-29.3,-28.8],[4.5,4.5,-3,-3],'k');%画人的左脚，设定位置，大小，填充颜色
a9=fill([-30.7,-31.2,-31.2,-30.7],[4.5,4.5,-3,-3],'k');%画人的右脚，设定位置，大小，填充颜色
%以下主持人走上舞台
dt=2;
t=-30;
x1=-30;
x2=-29.1;
x3=-30.9;
x4=-30.5;
x5=-29.5;
x6=-28;
x7=-28.8;
x8=-31.2;
x9=-32;
x10=-27;
x11=-28.8;
x12=-33;
x13=-31.2;
x14=-28.8;
x15=-29.3;
x16=-30.7;
x17=-31.2;
x18=-38;
x19=-22;
while t<=-10;
    t=t+dt;
    x1=x1+dt;
    x2=x2+dt;
    x3=x3+dt;
    x4=x4+dt;
    x5=x5+dt;
    x6=x6+dt;
    x7=x7+dt;
    x8=x8+dt;
    x9=x9+dt;
    x10=x10+dt;
    x11=x11+dt;
    x12=x12+dt;
    x13=x13+dt;
    x14=x14+dt;
    x15=x15+dt;
    x16=x16+dt;
    x17=x17+dt;
    x18=x18+dt;
    x19=x19+dt;
    set(a1,'xdata',x1 ,'ydata',12);%头的运动路线                  
    set(a2,'xdata',x2,'ydata',12.5);%左眼的运动路线
    set(a3,'xdata',x3,'ydata',12.5); %右眼的运动路线
    set(a4,'xdata',[x4,x5],'ydata',[11,11]);%嘴巴的运动轨迹
    set(a5,'xdata',[x6,x7,x8,x9],'ydata',[4.5,9.8,9.8,4.5]);%身体的运动路线
    set(a6,'xdata',[x10,x10,x11,x11],'ydata',[4.5,5.5,9.5,8.5]);%左手的运动路线
    set(a7,'xdata',[x12,x12,x13,x13],'ydata',[4.5,5.5,9.5,8.5]);%右手的运动路线
    set(a8,'xdata',[x14,x15,x15,x14],'ydata',[4.5,4.5,-3,-3]);%左脚的运动路线
    set(a9,'xdata',[x16,x17,x17,x16],'ydata',[4.5,4.5,-3,-3]);%右脚的运动路线
    pause(0.1);%停顿零点一秒
end;
pause(1);%停顿一秒
t1=text(-26,45,'感谢杂技演员为我们带来的精彩表演', 'fontsize' ,15,'color','b');
pause(2);%停顿两秒
delete(t1);
t2=text(-26,40,'又到了说再见的时候', 'fontsize' ,15,'color','b');
pause(1);%停顿一秒
t3=text(-26,35,'让我们一同唱起那熟悉的歌曲', 'fontsize' ,15,'color','b');
pause(1);;%停顿一秒
% delete(t2,t3);
t4=text(-15,45,'难忘今宵', 'fontsize' ,19,'color','b');
pause(1);;%停顿一秒
    t5=text(-15,40,'难忘今宵', 'fontsize' ,19,'color','b');
pause(1);;%停顿一秒
t6=text(-18,35,'无论天涯与海角', 'fontsize' ,19,'color','b');
pause(1);;%停顿一秒
t6=text(-16,30,'我们明年见', 'fontsize' ,19,'color','b');